IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/R5SS0_CCMR_R5SS0_CCMR.xml
<module name="R5SS0_CCMR_R5SS0_CCMR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="R5SS0_CCMR_CCMSR1" acronym="R5SS0_CCMR_CCMSR1" offset="0x0" width="32" description="">
		<bitfield id="CMPE1" width="1" begin="16" end="16" resetval="0x0" description="Compare Error0 = CPU signals are identical1= CPU signal compare mismatchWrites '1' to clear this bit" range="16" rwaccess="RW"/> 
		<bitfield id="STC1" width="1" begin="8" end="8" resetval="0x0" description="Self Test Complete0 = self test on-going if self test mode asserted1 = self test is completeWrites have no effect" range="8" rwaccess="RW"/> 
		<bitfield id="STET1" width="1" begin="1" end="1" resetval="0x0" description="Self Test Error Type0 = self test failed during Compare Match test1 = self test failed during Compare mismatch testWrites have no effect" range="1" rwaccess="RW"/> 
		<bitfield id="STE1" width="1" begin="0" end="0" resetval="0x0" description="Self Test Error0 = self test passed1 = self test failedWrites have no effect" range="0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_CCMR_CCMKEYR1" acronym="R5SS0_CCMR_CCMKEYR1" offset="0x4" width="32" description="">
		<bitfield id="MKEY1" width="4" begin="3" end="0" resetval="0x0" description="Mode Key0000 = lock step mode0110 = self test mode1001 = error forcing mode1111 = self test error forcing mode" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS0_CCMR_CCMSR2" acronym="R5SS0_CCMR_CCMSR2" offset="0x8" width="32" description="">
		<bitfield id="CMPE2" width="1" begin="16" end="16" resetval="0x0" description="Compare Error0 = VIM signals are identical1= VIM signal compare mismatchWrites '1' to clear this bit" range="16" rwaccess="RW"/> 
		<bitfield id="STC2" width="1" begin="8" end="8" resetval="0x0" description="Self Test Complete0 = self test on-going if self test mode asserted1 = self test is completeWrites have no effect" range="8" rwaccess="RW"/> 
		<bitfield id="STET2" width="1" begin="1" end="1" resetval="0x0" description="Self Test Error Type0 = self test failed during Compare Match test1 = self test failed during Compare mismatch testWrites have no effect" range="1" rwaccess="RW"/> 
		<bitfield id="STE2" width="1" begin="0" end="0" resetval="0x0" description="Self Test Error0 = self test passed1 = self test failedWrites have no effect" range="0" rwaccess="RW"/>
	</register>
	<register id="R5SS0_CCMR_CCMKEYR2" acronym="R5SS0_CCMR_CCMKEYR2" offset="0xC" width="32" description="">
		<bitfield id="MKEY2" width="4" begin="3" end="0" resetval="0x0" description="Mode Key0000 = lock step mode0110 = self test mode1001 = error forcing mode1111 = self test error forcing mode" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS0_CCMR_CCMSR3" acronym="R5SS0_CCMR_CCMSR3" offset="0x10" width="32" description="">
		<bitfield id="CMPE3" width="1" begin="16" end="16" resetval="0x0" description="Compare Error0 = Inactivity monitor signals are identical1= Inactivity monitor signal compare mismatchWrites '1' to clear this bit" range="16" rwaccess="RW"/> 
		<bitfield id="STC3" width="1" begin="8" end="8" resetval="0x0" description="Self Test Complete0 = self test on-going if self test mode asserted1 = self test is completeWrites have no effect" range="8" rwaccess="RW"/> 
		<bitfield id="STET3" width="1" begin="1" end="1" resetval="0x0" description="Self Test Error Type0 = self test failed during Compare Match test1 = self test failed during Compare mismatch testWrites have no effect" range="1" rwaccess="RW"/> 
		<bitfield id="STE3" width="1" begin="0" end="0" resetval="0x0" description="Self Test Error0 = self test passed1 = self test failedWrites have no effect" range="0" rwaccess="RO"/>
	</register>
	<register id="R5SS0_CCMR_CCMKEYR3" acronym="R5SS0_CCMR_CCMKEYR3" offset="0x14" width="32" description="">
		<bitfield id="MKEY3" width="4" begin="3" end="0" resetval="0x0" description="Mode Key0000 = lock step mode0110 = self test mode1001 = error forcing mode1111 = self test error forcing mode" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS0_CCMR_CCMPOLCNTRL" acronym="R5SS0_CCMR_CCMPOLCNTRL" offset="0x18" width="32" description="">
		<bitfield id="POL_INV" width="8" begin="7" end="0" resetval="0x0" description="This value is used to invert the 8 XOR of the CPU1 to create compare fail in functional active compare mode. User and privilege mode read = Returns current value of the POL INVPrivilege mode write = Update the values of POL INV" range="7 - 0" rwaccess="RO"/>
	</register>
</module>